{"Repository Identifier Authorized": null, "Repository Name Unauthorized": "Library of Congress American Folklife Center", "State": "DC", "Latitude": null, "Parent Org (Unauthorized)": null, "St City": "Washington", "Language of Entry": null, "Street Address 1": "101 Independence Ave SE", "Street Address 2": "LJ G53, Ground Floor, Jefferson Building", "St Zip Code (5 Numbers)": "20540", "Street Address County": null, "Location Type": "Reading Room", "St Zip Code (4 Following Numbers)": "4610", "URL": "http://www.loc.gov/folklife/", "Notes": "The American Folklife Center was created in 1976 by the U.S. Congress  to \"preserve and present American folklife\" through programs of research, documentation, archival preservation, reference service, live performance, exhibitions, publications, and training. Designated by the U.S. Congress as the national center for folklife documentation and research, the American Folklife Center continues to collect and document  living traditional culture, while preserving for the future its unparalleled collections in the state-of-the-art preservation facilities of the Library of Congress.\n    The American Folklife Center Archive, established in the Library of Congress Music Division in 1928, is now one of the largest archives of ethnographic materials from the United States and around the world, encompassing millions of items of ethnographic and historical documentation recorded from the nineteenth century to the present. These collections, which include extensive audiovisual documentation of traditional arts, cultural expressions, and oral histories, offer researchers access to the songs, stories, and other creative expressions of people from diverse communities.  ", "Longitude": null, "Name Notes": null, "Entry Recorded By": "Whitney Ray", "Source of Repository Data": "SAA@CUA", "Repository Type": "Government", "Date Entry Recorded": "2018-03-04 00:00:00", "Repository Name Authorized": null, "URL of Source of Repository Data": "https://saaatcua.wordpress.com/map/"}