{"Repository Identifier Authorized": null, "Repository Name Unauthorized": "Delta Air Transport Heritage Museum", "State": "GA", "Latitude": null, "Parent Org (Unauthorized)": null, "St City": "Atlanta", "Language of Entry": null, "Street Address 1": "1060 Delta Blvd.", "Street Address 2": "Dept. 914, Bldg. B", "St Zip Code (5 Numbers)": "30354", "Street Address County": "Fulton", "Location Type": "Unverified", "St Zip Code (4 Following Numbers)": null, "URL": "http://www.deltamuseum.org", "Notes": "The Museum's collections include: Delta's first Boeing 767, named the The Spirit of Delta. Bought by employees, retirees, and friends and donated to Delta in 1982. Interior contains two exhibitions. \"Ship 41\", the first DC-3 to carry Delta passengers. Restored by volunteers and a core mechanic team, 1993-1999. Winner in 2001 of the first National Trust for Historic Preservation award presented to an aircraft. A 1931 Travel Air, symbolizing Delta's first passenger aircraft. A 1936 Stinson Reliant SE. Nicknamed the \"Gull Wing,\" this unique aircraft served as an instrument trainer for Northeast Airlines pilots in 1941-1942. Replica of the first Delta station in Monroe, Louisiana. An 800-square-foot museum shop, housed in a redesigned section of the hull of the first L-1011 ever built.  1928 Northwest Airways Waco 125. Archives Holdings: 1924-present; bulk dates, 1941-1990. Total Volume: 11,000 cubic feet Description: Corporate collections include Delta Air Lines administrative, financial, legal, marketing, technical operations and public relations files, related to crop dusting activity, 1924-1966, and passenger service, 1929-present. Also records from airlines affiliated with Delta through mergers and route acquisitions: Chicago & Southern (C&S) Airlines, Western Airlines, Northeast Airlines, Northwest Airlines (including Southern Airways), and Pan Am (Pan Am collections are publications and artifacts only). Extensive holdings of photographic materials, flight schedules, uniforms, and passenger service equipment. Conditions of Access: Outside requests for information subject to approval by the Delta Air Transport Heritage Museum and Delta Air Lines Corporate Communications. ", "Longitude": null, "Name Notes": "Delta Air Lines Corporate Archives", "Entry Recorded By": "Whitney Ray", "Source of Repository Data": "Georgia Historical Records Advisory Council", "Repository Type": "Corporation", "Date Entry Recorded": "2018-03-10 00:00:00", "Repository Name Authorized": null, "URL of Source of Repository Data": null}