{"Repository Identifier Authorized": null, "Repository Name Unauthorized": "Emory University", "State": "GA", "Latitude": null, "Parent Org (Unauthorized)": null, "St City": "Atlanta", "Language of Entry": null, "Street Address 1": "540 Asbury Circle", "Street Address 2": "R.W. Woodruff Library", "St Zip Code (5 Numbers)": "30322", "Street Address County": "DeKalb", "Location Type": "Unverified", "St Zip Code (4 Following Numbers)": null, "URL": "http://marbl.library.emory.edu", "Notes": "Manuscripts include letters, diaries, photographs, audiovisual materials, and other records of individuals and organizations which relate to the history of the South and Georgia particularly in regard to southern Methodism, the Civil War, southern literature and journalism, Georgia politics and business; Irish and British literature, with a specialy in Modern Irish poetry; women's history, civil rights, American Communism, Irish and British literary figures, modern Irish poetry, and African-American history and culture, particularly black print culture.  Rare books include incunabula, Victorian literature and detective fiction, Irish literature and modern Irish poetry, works authored and printed by the African-American community, 20th-century southern authors, history and culture of Belgium, Confederate imprints, and French Revolution pamphlets.   University Archives include official university publications, student publications, photographs, administrative reports, minutes, and other materials relating to the history of Emory University and its predecessor schools from the founding of Emory College in 1836 to the present.", "Longitude": null, "Name Notes": "Stuart A. Rose Manuscript, Archives and Rare Book Library", "Entry Recorded By": "Whitney Ray", "Source of Repository Data": "Georgia Historical Records Advisory Council", "Repository Type": "College/University", "Date Entry Recorded": "2018-03-10 00:00:00", "Repository Name Authorized": null, "URL of Source of Repository Data": null}