{"Repository Identifier Authorized": null, "Repository Name Unauthorized": "Mercer University School of Medicine", "State": "GA", "Latitude": null, "Parent Org (Unauthorized)": null, "St City": "Macon", "Language of Entry": null, "Street Address 1": "1550 College St.    ", "Street Address 2": null, "St Zip Code (5 Numbers)": "31207", "Street Address County": "Bibb", "Location Type": "Unverified", "St Zip Code (4 Following Numbers)": null, "URL": "http://med.mercer.edu/library/", "Notes": "Medical Library collections include books, audiovisuals, journals, and government documents, in both print and electronic formats. LRC collections include x-rays, anatomical models, charts, simulators, disarticulated bones, plastinated pathological specimens, and computer assisted instruction programs. The Will C. Sealy History of Medicine Library and the Mercer University School of Medicine Archives house historical and archival materials. The Sealy Library collects books and other items which foster a broader understanding of worldwide medical and scientific history. It includes histories of medical organizations and clinical disciplines, early medical textbooks, and biographies of individuals who are significant in the history of medicine. Areas of particular focus include early Georgia medicine, the medical education of primary care physicians in Georgia, and the health of Georgia citizens. The Mercer University School of Medicine Archives collects original materials related to the founding and history of the Mercer School of Medicine. Types of materials include yearbooks, bulletins, correspondence, committee minutes, newspaper clippings, photographs, videotapes, and oral history recordings. ", "Longitude": null, "Name Notes": "Peyton T. Anderson Learning Resources Center", "Entry Recorded By": "Whitney Ray", "Source of Repository Data": "Georgia Historical Records Advisory Council", "Repository Type": "College/University", "Date Entry Recorded": "2018-03-10 00:00:00", "Repository Name Authorized": null, "URL of Source of Repository Data": null}