{"Repository Identifier Authorized": null, "Repository Name Unauthorized": "Moultrie-Colquitt County Library", "State": "GA", "Latitude": null, "Parent Org (Unauthorized)": null, "St City": "Moultrie", "Language of Entry": null, "Street Address 1": "204 5th Street SE", "Street Address 2": null, "St Zip Code (5 Numbers)": "31768", "Street Address County": "Colquitt", "Location Type": "Unverified", "St Zip Code (4 Following Numbers)": null, "URL": "http://colquitt.k12.ga.us/public_lib/", "Notes": "The library contains the Emmett Lucas Collection relevant to the eastern seaboard of the United States. The library also contains a collection of materials concerning Scottish genealogy unique inthe entire world because the Odom Library is the archival and genealogical \"home\" to more than 120 of the Scottish Clan organizations. The library contains, as well, materials from many other groups as diverse as The American Cherokee Confederacy and The Sovereign Military Order of the Temple of Jerusalem. The Georgia Collection in the Odom Library will assist localgenealogists in their search for family information.The Librarians are collecting information about veterans as an adjunct to the general genealogy information in the Library. Materials include personal information forms supplied by veterans or their families, memorabilia, and books covering the history of various conflicts and Spence Air Base. Originally, only veterans who were residents of Colquitt Country or who were stationed at Spence Field were included. However, the project has expanded to include all veterans. A Veterans History Project form may be obtained from the genealogy librarian. ", "Longitude": null, "Name Notes": "Ellen Payne Odom Genealogy Library", "Entry Recorded By": "Whitney Ray", "Source of Repository Data": "Georgia Historical Records Advisory Council", "Repository Type": "Public Library", "Date Entry Recorded": "2018-03-10 00:00:00", "Repository Name Authorized": null, "URL of Source of Repository Data": null}