{"Repository Identifier Authorized": null, "Repository Name Unauthorized": "Savannah State University", "State": "GA", "Latitude": null, "Parent Org (Unauthorized)": null, "St City": "Savannah", "Language of Entry": null, "Street Address 1": "2200 Tompkins Rd", "Street Address 2": "Savannah State University Box 20394", "St Zip Code (5 Numbers)": "31404", "Street Address County": "Chatham", "Location Type": "Unverified", "St Zip Code (4 Following Numbers)": null, "URL": "http://library.savannahstate.edu/quick_links/use_the_archives.php", "Notes": "The collections of the Savannah State University Archives are organized into five broad areas: University Archives, Manuscript Collection, Visual Material Collection, Books, and Memorabilia. University Archives: The university archives contain records that provide an historical account of the daily administration of the University. Browse the University Archives: University Presidents Collection Southern Regional Press Institute Collection Manuscript Collection: The manuscripts collection contains papers of faculty, staff, and alumni related to the University's growth and development. Browse the Manuscript Collection: Butler Family Papers Gordon Family Papers Visual Materials: T he visual materials collection includes a variety of materials ranging from photographs to architectural drawings. Browse the Visual Materials: Presidents Gallery Campus Buildings Book Collection: The book collection contains published works by faculty, staff, and alumni of Savannah State University. Also included are works by various authors that have been donated to the Archives. Memorabilia: Sweatshirts, caps, buttons, pens, cups, cap & gowns, band uniforms are examples of items found in the memorabilia collection. ", "Longitude": null, "Name Notes": "Asa H. Gordon Library and Archives", "Entry Recorded By": "Whitney Ray", "Source of Repository Data": "Georgia Historical Records Advisory Council", "Repository Type": "College/University", "Date Entry Recorded": "2018-03-10 00:00:00", "Repository Name Authorized": null, "URL of Source of Repository Data": null}