{"Repository Identifier Authorized": null, "Repository Name Unauthorized": "University of Alabama at Birmingham Archives", "State": "AL", "Latitude": null, "Parent Org (Unauthorized)": null, "St City": "Birmingham", "Language of Entry": null, "Street Address 1": "1700 University Blvd", "Street Address 2": "UAB 351 LHL", "St Zip Code (5 Numbers)": "35294", "Street Address County": "Jefferson", "Location Type": "Unverified", "St Zip Code (4 Following Numbers)": "0013", "URL": "http://www.uab.edu/archives/", "Notes": "The UAB Archives originated as the Medical Center Archives.  In 1992 UAB President Charles A. McCallum, Jr., elevated the program to a university-wide archives charged with preserving the institutional memory of UAB and collecting materials relating to the history of the health sciences.  The University of Alabama at Birmingham was founded in 1969; but it developed out of the Birmingham Extension Center, founded in 1936, and the four-year Medical College of Alabama, established in Birmingham in 1945.  The UAB Archives is the official respository for archival collections at UAB and it contains both university records and manuscript collections.  The repository preserves a wide variety of materials, including letters, memos, photographs, scrapbooks, ledgers, audio/visuals, and university-related publications, ephemera, and realia.  Particularly important series include the administrative records of the presidents of UAB, including those of Dr. Joseph F. Volker, first president of UAB and first chancellor of The University of Alabama System; the administrative records of vice presidents, deans and departmental chairs; and the records of campus offices, such as Media Relations, Creative Services, Visual Media, Sports Information, Town and Gown Theatre, Laboratory for Medical Genetics, and Visual Arts Gallery.  Manuscript collections include the Birmingham Regional Health Systems Agency and its predecessors; James Hatcher, founder/director of Town and Gown Theatre; Dr. Tom Spies and his Spies Nutrition Clinic,", "Longitude": null, "Name Notes": null, "Entry Recorded By": "Whitney Ray", "Source of Repository Data": "Alabama Department of Archives and History", "Repository Type": "College/University", "Date Entry Recorded": "2018-01-29 00:00:00", "Repository Name Authorized": null, "URL of Source of Repository Data": "http://archives.state.al.us/"}